Repository: MassonNN/orca_descriptors
Catalog: docs/locale/*/LC_MESSAGES/benchmark.po
Languages: ru

source: Benchmark and Time Estimation
ru: Бенчмарк и оценка времени

source: Overview
ru: Обзор

source: The library includes a time estimation system that helps predict how long ORCA calculations will take. This is essential for planning large-scale QSAR descriptor calculations.
ru: Библиотека включает систему оценки времени, которая помогает предсказать, сколько времени займут расчеты ORCA. Это необходимо для планирования крупномасштабных расчетов дескрипторов QSAR.

source: How It Works
ru: Как это работает

source: The time estimation system uses a benchmark calculation to calibrate performance on your machine:
ru: Система оценки времени использует бенчмарк-расчет для калибровки производительности на вашей машине:

source: 1. **Benchmark Calculation**: A single-point calculation is run on benzene (C₁H₆) to measure:
ru: 1. **Бенчмарк-расчет**: Выполняется одноточечный расчет на бензоле (C₆H₆) для измерения:

source: - Number of basis functions
ru: - Количества базисных функций

source: - Time per SCF cycle
ru: - Времени одного SCF-цикла

source: - Total calculation time
ru: - Общего времени расчета

source: 2. **Scaling Formula**: For new molecules, the system estimates time using:
ru: 2. **Формула масштабирования**: Для новых молекул система оценивает время, используя:

source: - Molecular size scaling (O(N².⁵) for DFT calculations)
ru: - Масштабирование по размеру молекулы (O(N³.⁵) для DFT расчетов)

source: - Method type (SP, Opt, Freq)
ru: - Тип метода (SP, Opt, Freq)

source: - Number of processors
ru: - Количество процессоров

source: 3. **Parameter Scaling**: The system automatically adjusts for different:
ru: 3. **Масштабирование параметров**: Система автоматически корректирует для разных:

source: - Number of processors (accounts for parallel efficiency)
ru: - Количества процессоров (учитывает эффективность параллелизации)

source: - Basis sets (scales with size)
ru: - Базисных наборов (масштабирует по размеру)

source: - Functionals (accounts for computational cost)
ru: - Функционалов (учитывает вычислительную стоимость)

source: Why It's Needed
ru: Зачем это нужно

source: * **Planning**: Estimate total time for large datasets
ru: * **Планирование**: Оценка общего времени для больших наборов данных

source: * **Resource Management**: Allocate computational resources efficiently
ru: * **Управление ресурсами**: Эффективное распределение вычислительных ресурсов

source: * **Progress Tracking**: Monitor calculation progress
ru: * **Отслеживание прогресса**: Мониторинг прогресса расчетов

source: * **Optimization**: Choose optimal parameters for your hardware
ru: * **Оптимизация**: Выбор оптимальных параметров для вашего оборудования

source: Running a Benchmark
ru: Запуск бенчмарка

source: Using CLI
ru: Через CLI

source: The benchmark uses benzene as a standard test molecule and saves results to ``.orca_benchmark.json``.
ru: Бенчмарк использует бензол в качестве стандартной тестовой молекулы и сохраняет результаты в ``.orca_benchmark.json``.

source: Using Python
ru: Через Python

source: print(f"SCF cycle time: {benchmark_data['scf_time']:.2f} seconds")
ru: print(f"Время SCF-цикла: {benchmark_data['scf_time']:.2f} секунд")

source: print(f"Number of basis functions: {benchmark_data['n_basis']}")
ru: print(f"Количество базисных функций: {benchmark_data['n_basis']}")

source: Estimating Calculation Time
ru: Оценка времени расчета

source: This estimates time without running the actual calculation.
ru: Это оценивает время без запуска реального расчета.

source: print(f"Estimated time: {estimated_time:.2f} seconds")
ru: print(f"Оценка времени: {estimated_time:.2f} секунд")

source: Automatic Parameter Scaling
ru: Автоматическое масштабирование параметров

source: The system automatically scales benchmark data for different parameters. You don't need to re-run the benchmark if you change:
ru: Система автоматически масштабирует данные бенчмарка для разных параметров. Вам не нужно перезапускать бенчмарк, если вы меняете:

source: * **Number of processors**: Automatically accounts for parallel efficiency
ru: * **Количество процессоров**: Автоматически учитывает эффективность параллелизации

source: * **Basis set**: Scales based on basis set size (O(N³.⁵))
ru: * **Базисный набор**: Масштабирует на основе размера базисного набора (O(N³.⁵))

source: * **Functional**: Adjusts for relative computational cost
ru: * **Функционал**: Корректирует для относительной вычислительной стоимости

source: Example: If your benchmark was run with 1 processor and def2-SVP, you can estimate time for 4 processors and def2-TZVP without re-running the benchmark.
ru: Пример: Если ваш бенчмарк был запущен с 1 процессором и def2-SVP, вы можете оценить время для 4 процессоров и def2-TZVP без перезапуска бенчмарка.

source: Benchmark File Location
ru: Расположение файла бенчмарка

source: The benchmark data is saved to::
ru: Данные бенчмарка сохраняются в::

source: This file contains:
ru: Этот файл содержит:

source: * Functional and basis set used
ru: * Использованные функционал и базисный набор

source: * Number of processors
ru: * Количество процессоров

source: * Number of basis functions
ru: * Количество базисных функций

source: * SCF cycle time
ru: * Время SCF-цикла

source: * Total calculation time
ru: * Общее время расчета

source: You can share this file between different working directories if using the same hardware and ORCA version.
ru: Вы можете использовать этот файл в разных рабочих директориях, если используете то же оборудование и версию ORCA.
