Repository: MassonNN/orca_descriptors
Catalog: docs/locale/*/LC_MESSAGES/changelog.po
Languages: ru

source: Changelog
ru: История изменений

source: Version 0.2.2
ru: Версия 0.2.2

source: Added
ru: Добавлено

source: * Added ``numpy>=1.20.0`` to project dependencies (numpy was used but not declared)
ru: * Добавлена зависимость ``numpy>=1.20.0`` в проект (numpy использовался, но не был объявлен)

source: * Added dynamic time estimation updates in batch processing - time estimates are now refined based on actual execution times of previous molecules
ru: * Добавлено динамическое обновление оценки времени при пакетной обработке - оценки времени теперь уточняются на основе реального времени выполнения предыдущих молекул

source: * Added ``_get_available_descriptors()`` method to dynamically discover available descriptor methods
ru: * Добавлен метод ``_get_available_descriptors()`` для динамического обнаружения доступных методов-дескрипторов

source: Changed
ru: Изменено

source: * Updated dipole moment parser to prioritize gas-phase values when available (for calculations without solvation)
ru: * Обновлен парсер дипольного момента для приоритизации газофазных значений при их наличии (для расчетов без сольватации)

source: * Improved time estimation algorithm:
ru: * Улучшен алгоритм оценки времени:

source: * Changed scaling exponent from O(N^3.5) to O(N^2.5) for more realistic estimates
ru: * Изменен показатель масштабирования с O(N^3.5) на O(N^2.5) для более реалистичных оценок

source: * Uses ``total_time`` from benchmark instead of ``scf_time`` as base unit
ru: * Используется ``total_time`` из benchmark вместо ``scf_time`` как базовая единица

source: * More realistic optimization step estimation (15-35 steps instead of 10-50)
ru: * Более реалистичная оценка шагов оптимизации (15-35 шагов вместо 10-50)

source: * Removed artificial 24-hour time cap
ru: * Удален искусственный предел в 24 часа

source: * Refactored ``calculate_descriptors()`` method:
ru: * Рефакторинг метода ``calculate_descriptors()``:

source: * Removed redundant code duplication (replaced large if-elif chain with ``getattr``-based method calls)
ru: * Убрано дублирование кода (заменена большая цепочка if-elif на вызовы методов через ``getattr``)

source: * Removed redundant ``all_descriptors`` list - descriptors are now discovered dynamically
ru: * Удален избыточный список ``all_descriptors`` - дескрипторы теперь обнаруживаются динамически

source: * Removed unnecessary comments
ru: * Удалены ненужные комментарии

source: * Improved code maintainability and readability
ru: * Улучшена поддерживаемость и читаемость кода

source: Fixed
ru: Исправлено

source: * Fixed dipole moment parser to correctly extract gas-phase values from ORCA output when available
ru: * Исправлен парсер дипольного момента для корректного извлечения газофазных значений из вывода ORCA при их наличии

source: * Fixed time estimation showing unrealistic values (e.g., 47 hours for 2 molecules) - now provides accurate estimates based on actual benchmark data
ru: * Исправлена оценка времени, показывавшая нереалистичные значения (например, 47 часов для 2 молекул) - теперь предоставляет точные оценки на основе реальных данных benchmark

source: Technical Details
ru: Технические детали

source: * Time estimator now uses exponential moving average for better prediction accuracy
ru: * Оценщик времени теперь использует экспоненциальное скользящее среднее для лучшей точности прогнозирования

source: * Descriptor methods are called dynamically using ``getattr(self, desc_name)``
ru: * Методы дескрипторов вызываются динамически с использованием ``getattr(self, desc_name)``

source: * Automatic descriptor discovery eliminates need to maintain manual descriptor lists
ru: * Автоматическое обнаружение дескрипторов устраняет необходимость поддерживать списки дескрипторов вручную
