Repository: MassonNN/orca_descriptors
Catalog: docs/locale/*/LC_MESSAGES/cli.po
Languages: ru

source: Command-Line Interface
ru: Интерфейс командной строки

source: The library provides a command-line interface (CLI) for running benchmarks and estimating calculation times.
ru: Библиотека предоставляет интерфейс командной строки (CLI) для запуска бенчмарков и оценки времени расчетов.

source: Commands
ru: Команды

source: Run a benchmark calculation to calibrate time estimation::
ru: Запустить бенчмарк-расчет для калибровки оценки времени::

source: orca_descriptors run_benchmark [OPTIONS]
ru: orca_descriptors run_benchmark [ОПЦИИ]

source: Options:
ru: Опции:

source: * ``--working_dir``: Working directory for calculations (default: current directory)
ru: * ``--working_dir``: Рабочая директория для расчетов (по умолчанию: текущая директория)

source: * ``--functional``: DFT functional (default: PBE0)
ru: * ``--functional``: DFT функционал (по умолчанию: PBE0)

source: * ``--basis_set``: Basis set (default: def2-SVP)
ru: * ``--basis_set``: Базисный набор (по умолчанию: def2-SVP)

source: * ``--n_processors``: Number of processors (default: 1)
ru: * ``--n_processors``: Количество процессоров (по умолчанию: 1)

source: * All other ORCA parameters are also available
ru: * Все остальные параметры ORCA также доступны

source: Example::
ru: Пример::

source: Estimate calculation time for a molecule without running the calculation::
ru: Оценить время расчета для молекулы без запуска расчета::

source: orca_descriptors approximate_time --molecule SMILES [OPTIONS]
ru: orca_descriptors approximate_time --molecule SMILES [ОПЦИИ]

source: Required arguments:
ru: Обязательные аргументы:

source: * ``--molecule``: SMILES string of the molecule
ru: * ``--molecule``: SMILES строка молекулы

source: * ``--method_type``: Calculation type - Opt, SP, or Freq (default: Opt)
ru: * ``--method_type``: Тип расчета - Opt, SP или Freq (по умолчанию: Opt)

source: * ``--n_opt_steps``: Expected number of optimization steps (for Opt method)
ru: * ``--n_opt_steps``: Ожидаемое количество шагов оптимизации (для метода Opt)

source: * All ORCA parameters are available
ru: * Все параметры ORCA доступны

source: Available Parameters
ru: Доступные параметры

source: All parameters from the ``Orca`` class are available as command-line arguments:
ru: Все параметры класса ``Orca`` доступны как аргументы командной строки:

source: * ``--script_path``: Path to ORCA executable (default: 'orca')
ru: * ``--script_path``: Путь к исполняемому файлу ORCA (по умолчанию: 'orca')

source: * ``--working_dir``: Working directory for calculations
ru: * ``--working_dir``: Рабочая директория для расчетов

source: * ``--output_dir``: Directory for output files
ru: * ``--output_dir``: Директория для выходных файлов

source: * ``--method_type``: Calculation type: Opt, SP, or Freq (default: Opt)
ru: * ``--method_type``: Тип расчета: Opt, SP или Freq (по умолчанию: Opt)

source: * ``--dispersion_correction``: Dispersion correction, e.g., D3BJ (default: D3BJ). Use 'None' to disable.
ru: * ``--dispersion_correction``: Коррекция дисперсии, например, D3BJ (по умолчанию: D3BJ). Используйте 'None' для отключения.

source: * ``--solvation_model``: Solvation model, e.g., 'COSMO(Water)' (default: None)
ru: * ``--solvation_model``: Модель сольватации, например, 'COSMO(Water)' (по умолчанию: None)

source: * ``--max_scf_cycles``: Maximum SCF cycles (default: 100)
ru: * ``--max_scf_cycles``: Максимальное количество SCF циклов (по умолчанию: 100)

source: * ``--scf_convergence``: SCF convergence threshold (default: 1e-6)
ru: * ``--scf_convergence``: Порог сходимости SCF (по умолчанию: 1e-6)

source: * ``--charge``: Molecular charge (default: 0)
ru: * ``--charge``: Заряд молекулы (по умолчанию: 0)

source: * ``--multiplicity``: Spin multiplicity (default: 1)
ru: * ``--multiplicity``: Спиновая мультиплетность (по умолчанию: 1)

source: * ``--cache_dir``: Directory for caching results
ru: * ``--cache_dir``: Директория для кеширования результатов

source: * ``--log_level``: Logging level: DEBUG, INFO, WARNING, ERROR (default: INFO)
ru: * ``--log_level``: Уровень логирования: DEBUG, INFO, WARNING, ERROR (по умолчанию: INFO)

source: * ``--max_wait``: Maximum time to wait for output file creation in seconds (default: 300)
ru: * ``--max_wait``: Максимальное время ожидания создания выходного файла в секундах (по умолчанию: 300)

source: Help
ru: Справка

source: Get help for any command::
ru: Получить справку по любой команде::
