Repository: MassonNN/orca_descriptors
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: ru

source: Installation
ru: Установка

source: Requirements
ru: Требования

source: * ORCA 6.0.1 installed and available in PATH
ru: * ORCA 6.0.1 установлен и доступен в PATH

source: Installing ORCA
ru: Установка ORCA

source: ORCA is a quantum chemistry program that must be installed separately.
ru: ORCA — это программа квантовой химии, которую необходимо установить отдельно.

source: 1. Download ORCA from the official website: https://orcaforum.kofo.mpg.de/
ru: 1. Скачайте ORCA с официального сайта: https://orcaforum.kofo.mpg.de/

source: 2. Extract and add the ORCA executable to your system PATH
ru: 2. Распакуйте и добавьте исполняемый файл ORCA в системный PATH

source: 3. Verify installation by running::
ru: 3. Проверьте установку, выполнив::

source: Installing the Library
ru: Установка библиотеки

source: Using pip
ru: С помощью pip

source: Using Poetry (Development)
ru: С помощью Poetry (для разработки)

source: Verification
ru: Проверка

source: After installation, verify that the library works::
ru: После установки проверьте, что библиотека работает::

source: You can also test the CLI::
ru: Также можно проверить CLI::
