Repository: MassonNN/orca_descriptors
Catalog: docs/locale/*/LC_MESSAGES/pandas_tutorial.po
Languages: ru

source: Pandas Integration Tutorial
ru: Туториал по интеграции с Pandas

source: This tutorial demonstrates how to use the ORCA Descriptors library with pandas for efficient batch processing of molecular descriptors.
ru: Этот туториал демонстрирует, как использовать библиотеку ORCA Descriptors вместе с pandas для эффективной пакетной обработки молекулярных дескрипторов.

source: Installation
ru: Установка

source: To use pandas integration, install pandas as an optional dependency::
ru: Для использования интеграции с pandas установите pandas как опциональную зависимость::

source: Or install pandas separately::
ru: Или установите pandas отдельно::

source: Basic Usage
ru: Базовое использование

source: The ``calculate_descriptors`` method provides seamless integration with pandas DataFrames and Series.
ru: Метод ``calculate_descriptors`` обеспечивает бесшовную интеграцию с pandas DataFrame и Series.

source: Calculating All Descriptors
ru: Расчет всех дескрипторов

source: By default, ``calculate_descriptors`` calculates all available descriptors for each molecule::
ru: По умолчанию ``calculate_descriptors`` вычисляет все доступные дескрипторы для каждой молекулы::

source: # Initialize ORCA calculator
ru: # Инициализация калькулятора ORCA

source: # Create a DataFrame with SMILES strings
ru: # Создание DataFrame со SMILES строками

source: 'name': ['Benzene', 'Ethanol', 'Acetone']
ru: 'name': ['Бензол', 'Этанол', 'Ацетон']

source: # Calculate all descriptors
ru: # Расчет всех дескрипторов

source: # The DataFrame now contains all descriptor columns
ru: # DataFrame теперь содержит все колонки дескрипторов

source: # Output: Index(['smiles', 'name', 'homo_energy', 'lumo_energy', 'gap_energy', ...])
ru: # Вывод: Index(['smiles', 'name', 'homo_energy', 'lumo_energy', 'gap_energy', ...])

source: # Access descriptor values
ru: # Доступ к значениям дескрипторов

source: Selecting Specific Descriptors
ru: Выбор конкретных дескрипторов

source: You can specify which descriptors to calculate using the ``descriptors`` parameter::
ru: Вы можете указать, какие дескрипторы вычислять, используя параметр ``descriptors``::

source: # Calculate only specific descriptors
ru: # Расчет только конкретных дескрипторов

source: # Only selected descriptors are calculated
ru: # Вычисляются только выбранные дескрипторы

source: # Output: Index(['smiles', 'name', 'homo_energy', 'lumo_energy', 'gap_energy', 'dipole_moment', 'molecular_volume'])
ru: # Вывод: Index(['smiles', 'name', 'homo_energy', 'lumo_energy', 'gap_energy', 'dipole_moment', 'molecular_volume'])

source: Working with Series
ru: Работа с Series

source: You can also pass a pandas Series directly::
ru: Вы также можете передать pandas Series напрямую::

source: # Create a Series with SMILES
ru: # Создание Series со SMILES

source: # Calculate descriptors
ru: # Расчет дескрипторов

source: # Result is a DataFrame with 'smiles' and all descriptor columns
ru: # Результат - DataFrame с колонками 'smiles' и всеми дескрипторами

source: Progress Tracking
ru: Отслеживание прогресса

source: The method provides progress information by default::
ru: Метод по умолчанию предоставляет информацию о прогрессе::

source: # Process many molecules with progress output
ru: # Обработка множества молекул с выводом прогресса

source: 'smiles': ['C1=CC=CC=C1'] * 10 # 10 molecules
ru: 'smiles': ['C1=CC=CC=C1'] * 10 # 10 молекул

source: progress=True # Default: shows progress
ru: progress=True # По умолчанию: показывает прогресс

source: # Output:
ru: # Вывод:

source: To disable progress output::
ru: Для отключения вывода прогресса::

source: Example: QSAR Dataset Preparation
ru: Пример: Подготовка QSAR датасета

source: Here's a complete example of preparing a QSAR dataset::
ru: Полный пример подготовки QSAR датасета::

source: # Initialize calculator
ru: # Инициализация калькулятора

source: # Load your molecular dataset
ru: # Загрузка вашего молекулярного датасета

source: df = pd.read_csv('molecules.csv') # Contains 'smiles' column
ru: df = pd.read_csv('molecules.csv') # Содержит колонку 'smiles'

source: # Filter molecules based on descriptors
ru: # Фильтрация молекул на основе дескрипторов

source: # Save results
ru: # Сохранение результатов

source: # Statistical analysis
ru: # Статистический анализ

source: Example: Custom Descriptor Selection
ru: Пример: Выбор пользовательских дескрипторов

source: Calculate only energy-related descriptors for a large dataset::
ru: Вычисление только энергетических дескрипторов для большого датасета::

source: # Analyze energy trends
ru: # Анализ энергетических трендов

source: Error Handling
ru: Обработка ошибок

source: The method handles errors gracefully. If a descriptor calculation fails for a molecule, it sets that value to ``None`` and continues processing::
ru: Метод корректно обрабатывает ошибки. Если расчет дескриптора для молекулы не удался, значение устанавливается в ``None``, и обработка продолжается::

source: # Some molecules might fail descriptor calculation
ru: # Некоторые молекулы могут не пройти расчет дескрипторов

source: # Failed calculations are marked as None
ru: # Неудачные расчеты помечены как None

source: Available Descriptors
ru: Доступные дескрипторы

source: The following descriptors are available for calculation:
ru: Следующие дескрипторы доступны для расчета:

source: **Energy Descriptors:**
ru: **Энергетические дескрипторы:**

source: - ``homo_energy`` - HOMO energy (eV)
ru: - ``homo_energy`` - Энергия HOMO (эВ)

source: - ``lumo_energy`` - LUMO energy (eV)
ru: - ``lumo_energy`` - Энергия LUMO (эВ)

source: - ``gap_energy`` - HOMO-LUMO gap (eV)
ru: - ``gap_energy`` - Зазор HOMO-LUMO (эВ)

source: - ``total_energy`` - Total energy (Hartree)
ru: - ``total_energy`` - Полная энергия (Хартри)

source: - ``gibbs_free_energy`` - Gibbs free energy (Hartree)
ru: - ``gibbs_free_energy`` - Энергия Гиббса (Хартри)

source: - ``entropy`` - Entropy (J/(mol·K))
ru: - ``entropy`` - Энтропия (Дж/(моль·К))

source: - ``enthalpy`` - Enthalpy (Hartree)
ru: - ``enthalpy`` - Энтальпия (Хартри)

source: **DFT Descriptors:**
ru: **DFT дескрипторы:**

source: - ``ch_potential`` - Chemical potential (eV)
ru: - ``ch_potential`` - Химический потенциал (эВ)

source: - ``electronegativity`` - Electronegativity (eV)
ru: - ``electronegativity`` - Электроотрицательность (эВ)

source: - ``abs_hardness`` - Absolute hardness (eV)
ru: - ``abs_hardness`` - Абсолютная жесткость (эВ)

source: - ``abs_softness`` - Absolute softness (1/eV)
ru: - ``abs_softness`` - Абсолютная мягкость (1/эВ)

source: - ``frontier_electron_density`` - Maximum frontier electron density
ru: - ``frontier_electron_density`` - Максимальная плотность электронов на граничных орбиталях

source: **Polar Surface Descriptors:**
ru: **Дескрипторы полярной поверхности:**

source: - ``dipole_moment`` - Dipole moment (Debye)
ru: - ``dipole_moment`` - Дипольный момент (Дебай)

source: - ``polar_surface_area`` - Polar surface area (Å²)
ru: - ``polar_surface_area`` - Полярная площадь поверхности (Å²)

source: - ``get_min_h_charge`` - Minimum hydrogen charge
ru: - ``get_min_h_charge`` - Минимальный заряд водорода

source: **Thermodynamic Descriptors:**
ru: **Термодинамические дескрипторы:**

source: - ``molecular_volume`` - Molecular volume (Å³)
ru: - ``molecular_volume`` - Молекулярный объем (Å³)

source: **Multi-dimensional Descriptors:**
ru: **Многомерные дескрипторы:**

source: - ``num_rotatable_bonds`` - Number of rotatable bonds
ru: - ``num_rotatable_bonds`` - Количество вращающихся связей

source: - ``wiener_index`` - Wiener index
ru: - ``wiener_index`` - Индекс Винера

source: **Geometric Descriptors:**
ru: **Геометрические дескрипторы:**

source: - ``xy_shadow`` - XY projection area (Å²)
ru: - ``xy_shadow`` - Площадь проекции на плоскость XY (Å²)

source: **Reactivity Descriptors:**
ru: **Дескрипторы реактивности:**

source: - ``meric`` - Minimum electrophilicity index for carbon (eV)
ru: - ``meric`` - Минимальный индекс электрофильности для углерода (эВ)

source: **Physicochemical Descriptors:**
ru: **Физико-химические дескрипторы:**

source: - ``m_log_p`` - Moriguchi Log P (octanol/water partition coefficient)
ru: - ``m_log_p`` - Моригути Log P (коэффициент распределения октанол/вода)

source: **Autocorrelation Descriptors:**
ru: **Дескрипторы автокорреляции:**

source: - ``moran_autocorrelation`` - Moran autocorrelation (lag=2, weight='vdw_volume')
ru: - ``moran_autocorrelation`` - Автокорреляция Моран (lag=2, weight='vdw_volume')

source: - ``autocorrelation_hats`` - HATS autocorrelation (lag=4, unweighted=True)
ru: - ``autocorrelation_hats`` - Автокорреляция HATS (lag=4, unweighted=True)

source: Tips and Best Practices
ru: Советы и лучшие практики

source: 1. **Caching**: The library automatically caches calculation results. If you recalculate descriptors for the same molecules, it will use cached results.
ru: 1. **Кэширование**: Библиотека автоматически кэширует результаты расчетов. Если вы пересчитываете дескрипторы для тех же молекул, будут использованы кэшированные результаты.

source: 2. **Batch Processing**: For large datasets, process molecules in batches to manage memory and computation time.
ru: 2. **Пакетная обработка**: Для больших датасетов обрабатывайте молекулы пакетами для управления памятью и временем вычислений.

source: 3. **Descriptor Selection**: Use the ``descriptors`` parameter to calculate only the descriptors you need, which can significantly reduce computation time.
ru: 3. **Выбор дескрипторов**: Используйте параметр ``descriptors`` для расчета только нужных дескрипторов, что может значительно сократить время вычислений.

source: 4. **Progress Monitoring**: Keep ``progress=True`` (default) to monitor long-running calculations.
ru: 4. **Мониторинг прогресса**: Оставляйте ``progress=True`` (по умолчанию) для отслеживания длительных расчетов.

source: 5. **Data Validation**: Check for ``None`` values in the result DataFrame to identify molecules that failed descriptor calculation.
ru: 5. **Валидация данных**: Проверяйте значения ``None`` в результирующем DataFrame для выявления молекул, для которых не удался расчет дескрипторов.

source: Example: Batch Processing
ru: Пример: Пакетная обработка

source: # Process in batches
ru: # Обработка пакетами

source: # Combine results
ru: # Объединение результатов
