Repository: MassonNN/orca_descriptors
Catalog: docs/locale/*/LC_MESSAGES/tutorial.po
Languages: ru

source: Tutorial
ru: Туториал

source: This tutorial will guide you through using the ORCA Descriptors library both as a Python library and as a command-line tool.
ru: Этот туториал покажет, как использовать библиотеку ORCA Descriptors как через Python, так и через командную строку.

source: Using as a Python Library
ru: Использование как Python библиотека

source: Basic Usage
ru: Базовое использование

source: First, import the necessary classes::
ru: Сначала импортируйте необходимые классы::

source: Initialize the ORCA calculator with your preferred settings::
ru: Инициализируйте калькулятор ORCA с нужными настройками::

source: Create a molecule from a SMILES string::
ru: Создайте молекулу из SMILES строки::

source: mol = AddHs(MolFromSmiles("C1=CC=CC=C1")) # Benzene
ru: mol = AddHs(MolFromSmiles("C1=CC=CC=C1")) # Бензол

source: Calculate descriptors::
ru: Рассчитайте дескрипторы::

source: # Energy descriptors
ru: # Энергетические дескрипторы

source: # DFT descriptors
ru: # DFT дескрипторы

source: # Thermodynamic descriptors
ru: # Термодинамические дескрипторы

source: # Molecular orbital descriptors
ru: # Дескрипторы молекулярных орбиталей

source: homo_minus_1 = orca.mo_energy(mol, index=-2) # HOMO-1 energy
ru: homo_minus_1 = orca.mo_energy(mol, index=-2) # Энергия HOMO-1

source: # Charge descriptors
ru: # Дескрипторы зарядов

source: min_h_charge = orca.get_min_h_charge(mol, method="ESP") # Minimum H charge
ru: min_h_charge = orca.get_min_h_charge(mol, method="ESP") # Минимальный заряд водорода

source: # Geometric descriptors
ru: # Геометрические дескрипторы

source: xy_area = orca.xy_shadow(mol) # XY projection area
ru: xy_area = orca.xy_shadow(mol) # Площадь проекции на плоскость XY

source: # Reactivity descriptors
ru: # Дескрипторы реакционной способности

source: meric = orca.meric(mol) # Electrophilicity index for carbon
ru: meric = orca.meric(mol) # Индекс электрофильности для углерода

source: # Topological descriptors
ru: # Топологические дескрипторы

source: t_oo = orca.topological_distance(mol, 'O', 'O') # Sum of O-O distances
ru: t_oo = orca.topological_distance(mol, 'O', 'O') # Сумма расстояний O-O

source: nrot = orca.num_rotatable_bonds(mol) # Number of rotatable bonds
ru: nrot = orca.num_rotatable_bonds(mol) # Количество вращающихся связей

source: wiener = orca.wiener_index(mol) # Wiener index
ru: wiener = orca.wiener_index(mol) # Индекс Винера

source: # Physicochemical descriptors
ru: # Физико-химические дескрипторы

source: logp = orca.m_log_p(mol) # Octanol/water partition coefficient
ru: logp = orca.m_log_p(mol) # Коэффициент распределения октанол/вода

source: # Autocorrelation descriptors
ru: # Дескрипторы автокорреляции

source: Caching
ru: Кеширование

source: The library automatically caches calculation results. If you calculate descriptors for the same molecule with the same parameters, it will use the cached result instead of running ORCA again::
ru: Библиотека автоматически кеширует результаты расчетов. Если вы рассчитываете дескрипторы для той же молекулы с теми же параметрами, будет использован кешированный результат::

source: # First calculation - runs ORCA
ru: # Первый расчет - запускает ORCA

source: homo1 = orca.homo_energy(mol) # Takes time
ru: homo1 = orca.homo_energy(mol) # Занимает время

source: # Second calculation - uses cache
ru: # Второй расчет - использует кеш

source: homo2 = orca.homo_energy(mol) # Instant
ru: homo2 = orca.homo_energy(mol) # Мгновенно

source: Using as a Command-Line Tool
ru: Использование как консольная утилита

source: The library can also be used as a command-line utility after installation.
ru: Библиотеку также можно использовать как консольную утилиту после установки.

source: Run Benchmark
ru: Запуск бенчмарка

source: Before estimating calculation times, run a benchmark::
ru: Перед оценкой времени расчетов запустите бенчмарк::

source: Estimate Calculation Time
ru: Оценка времени расчета

source: Estimate how long a calculation will take::
ru: Оцените, сколько времени займет расчет::

source: All ORCA parameters are available as CLI arguments. For example::
ru: Все параметры ORCA доступны как аргументы CLI. Например::

source: Example Workflow
ru: Пример рабочего процесса

source: Here's a complete example of calculating descriptors for multiple molecules::
ru: Вот полный пример расчета дескрипторов для нескольких молекул::

source: # Initialize calculator
ru: # Инициализация калькулятора

source: # List of molecules to process
ru: # Список молекул для обработки

source: "C1=CC=CC=C1", # Benzene
ru: "C1=CC=CC=C1", # Бензол

source: "CCO", # Ethanol
ru: "CCO", # Этанол

source: "CC(=O)C", # Acetone
ru: "CC(=O)C", # Ацетон

source: # Process results
ru: # Обработка результатов

source: Available Descriptors
ru: Доступные дескрипторы

source: The library provides a comprehensive set of descriptors for QSAR analysis:
ru: Библиотека предоставляет комплексный набор дескрипторов для QSAR анализа:

source: Energy Descriptors
ru: Энергетические дескрипторы

source: - ``homo_energy(mol)`` - HOMO energy (eV)
ru: - ``homo_energy(mol)`` - Энергия HOMO (эВ)

source: - ``lumo_energy(mol)`` - LUMO energy (eV)
ru: - ``lumo_energy(mol)`` - Энергия LUMO (эВ)

source: - ``gap_energy(mol)`` - HOMO-LUMO gap (eV)
ru: - ``gap_energy(mol)`` - Разрыв HOMO-LUMO (эВ)

source: - ``mo_energy(mol, index)`` - Molecular orbital energy by index (eV)
ru: - ``mo_energy(mol, index)`` - Энергия молекулярной орбитали по индексу (эВ)

source: - ``total_energy(mol)`` - Total energy (Hartree)
ru: - ``total_energy(mol)`` - Полная энергия (Хартри)

source: DFT Descriptors
ru: DFT дескрипторы

source: - ``ch_potential(mol)`` - Chemical potential (eV)
ru: - ``ch_potential(mol)`` - Химический потенциал (эВ)

source: - ``electronegativity(mol)`` - Electronegativity (eV)
ru: - ``electronegativity(mol)`` - Электроотрицательность (эВ)

source: - ``abs_hardness(mol)`` - Absolute hardness (eV)
ru: - ``abs_hardness(mol)`` - Абсолютная жесткость (эВ)

source: - ``abs_softness(mol)`` - Absolute softness (1/eV)
ru: - ``abs_softness(mol)`` - Абсолютная мягкость (1/эВ)

source: - ``frontier_electron_density(mol)`` - Frontier electron density
ru: - ``frontier_electron_density(mol)`` - Плотность фронтирных электронов

source: Charge Descriptors
ru: Дескрипторы зарядов

source: - ``get_atom_charges(mol)`` - Mulliken atomic charges
ru: - ``get_atom_charges(mol)`` - Атомные заряды Малликена

source: - ``get_min_h_charge(mol, method="ESP")`` - Minimum hydrogen charge
ru: - ``get_min_h_charge(mol, method="ESP")`` - Минимальный заряд водорода

source: Geometric Descriptors
ru: Геометрические дескрипторы

source: - ``xy_shadow(mol)`` - XY projection area (Å²)
ru: - ``xy_shadow(mol)`` - Площадь проекции на плоскость XY (Å²)

source: - ``molecular_volume(mol)`` - Molecular volume (Å³)
ru: - ``molecular_volume(mol)`` - Молекулярный объем (Å³)

source: - ``get_bond_lengths(mol, atom1, atom2)`` - Bond lengths (Å)
ru: - ``get_bond_lengths(mol, atom1, atom2)`` - Длины связей (Å)

source: Reactivity Descriptors
ru: Дескрипторы реакционной способности

source: - ``meric(mol)`` - Minimum electrophilicity index for carbon (eV)
ru: - ``meric(mol)`` - Минимальный индекс электрофильности для углерода (эВ)

source: - ``dipole_moment(mol)`` - Dipole moment (Debye)
ru: - ``dipole_moment(mol)`` - Дипольный момент (Дебай)

source: Topological Descriptors
ru: Топологические дескрипторы

source: - ``topological_distance(mol, atom1, atom2)`` - Sum of topological distances
ru: - ``topological_distance(mol, atom1, atom2)`` - Сумма топологических расстояний

source: - ``num_rotatable_bonds(mol)`` - Number of rotatable bonds
ru: - ``num_rotatable_bonds(mol)`` - Количество вращающихся связей

source: - ``wiener_index(mol)`` - Wiener index
ru: - ``wiener_index(mol)`` - Индекс Винера

source: Physicochemical Descriptors
ru: Физико-химические дескрипторы

source: - ``m_log_p(mol)`` - Moriguchi Log P (octanol/water partition coefficient)
ru: - ``m_log_p(mol)`` - Коэффициент распределения Моригучи (октанол/вода)

source: - ``polar_surface_area(mol)`` - Polar surface area (Å²)
ru: - ``polar_surface_area(mol)`` - Полярная площадь поверхности (Å²)

source: - ``solvent_accessible_surface_area(mol)`` - SASA (Å²)
ru: - ``solvent_accessible_surface_area(mol)`` - Доступная площадь поверхности растворителя (Å²)

source: Thermodynamic Descriptors
ru: Термодинамические дескрипторы

source: - ``gibbs_free_energy(mol)`` - Gibbs free energy (Hartree)
ru: - ``gibbs_free_energy(mol)`` - Энергия Гиббса (Хартри)

source: - ``entropy(mol)`` - Entropy (J/(mol·K))
ru: - ``entropy(mol)`` - Энтропия (Дж/(моль·К))

source: - ``enthalpy(mol)`` - Enthalpy (Hartree)
ru: - ``enthalpy(mol)`` - Энтальпия (Хартри)

source: Autocorrelation Descriptors
ru: Дескрипторы автокорреляции

source: - ``moran_autocorrelation(mol, lag, weight)`` - Moran autocorrelation
ru: - ``moran_autocorrelation(mol, lag, weight)`` - Автокорреляция Моран

source: - ``autocorrelation_hats(mol, lag, unweighted)`` - HATS autocorrelation
ru: - ``autocorrelation_hats(mol, lag, unweighted)`` - Автокорреляция HATS
